ERP.belugaerp/src/InformationRegisters/бг_ТранспортнаяИнформация/бг_ТранспортнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ТранспортнаяИнформация</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПунктНазначения</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорНаПеревозку</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорСубподряда</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВидПеревозки</name>
    <type>
      <types>CatalogRef.бг_ВидыПеревозки</types>
    </type>
  </resources>
  <resources>
    <name>ДоверенностьНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоверенностьДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоверенностьЧерез</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерЗаказа</name>
    <comment>Номер Заказа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомераПломб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ХранилищеДополнительныхСведений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеСведенийТНиСВ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаТН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>ПорядковыйНомерТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипВладенияТС</name>
    <type>
      <types>CatalogRef.бг_ТипыВладенияТС</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизаторПеревозки</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорНаВладение</name>
    <type>
      <types>CatalogRef.бг_ДоговорыВладенияТС</types>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоговорНаВладениеПрицеп</name>
    <type>
      <types>CatalogRef.бг_ДоговорыВладенияТС</types>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МыГрузимТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаДоставкиС</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаДоставкиПо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РучнаяКорректировкаДатыДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НомерКонтейнера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ОчередьЗаявокКлиентовКОтправкеOrderSP/бг_ОчередьЗаявокКлиентовКОтправкеOrderSP.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ОчередьЗаявокКлиентовКОтправкеOrderSP</name>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаявкаКлиента</name>
    <type>
      <types>DocumentRef.битЗаявкаКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/бг_ИсточникиЗагрузкиЗаказовКлиентов/бг_ИсточникиЗагрузкиЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ИсточникиЗагрузкиЗаказовКлиентов</name>
  <enumValues>
    <name>B2B</name>
  </enumValues>
  <enumValues>
    <name>Creatio</name>
  </enumValues>
  <enumValues>
    <name>EDI</name>
  </enumValues>
  <enumValues>
    <name>PortalDistr</name>
  </enumValues>
  <enumValues>
    <name>WINELAB_SAP</name>
  </enumValues>
  <enumValues>
    <name>WINELAB_SAP_СONSOLIDATED</name>
  </enumValues>
  <enumValues>
    <name>WINELAB_HYBRIS</name>
  </enumValues>
  <enumValues>
    <name>СобственныйКонтрагент</name>
  </enumValues>
  <enumValues>
    <name>ТвойДом</name>
  </enumValues>
  <enumValues>
    <name>Чикаго</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/InformationRegisters/бг_ТранспортнаяИнформация/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	ДобавитьМаршрутныеЛистыДляОтложеннойОбработки(ЭтотОбъект);
	ОбновитьПлановыеДатыДоставкиЗаявокКлиента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьМаршрутныеЛистыДляОтложеннойОбработки(НаборЗаписей)
	Если НаборЗаписей.ДополнительныеСвойства.Свойство("бг_ПерезаполнятьРейсы")
		И НаборЗаписей.ДополнительныеСвойства.бг_ПерезаполнятьРейсы = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ПоляТранспортнойИнформацииЗаполнениеМаршрутныхЛистов = ПоляТранспортнойИнформацииЗаполнениеМаршрутныхЛистов();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Не ЗначениеЗаполнено(Запись.Объект) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполненаТранспортнаяИнформацияМЛ = Ложь;
		Для Каждого Поле Из ПоляТранспортнойИнформацииЗаполнениеМаршрутныхЛистов Цикл
			Если ЗначениеЗаполнено(Запись[Поле]) Тогда
				ЗаполненаТранспортнаяИнформацияМЛ = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЗаполненаТранспортнаяИнформацияМЛ Тогда
			Продолжить;
		КонецЕсли;
		
		Документы.битМаршрутныйЛист.ДобавитьДокументыДляОтложеннойОбработки(Запись.Объект);
	КонецЦикла;
КонецПроцедуры

Функция ПоляТранспортнойИнформацииЗаполнениеМаршрутныхЛистов()
	ПоляТранспортнойИнформации = Новый Массив;
	ПоляТранспортнойИнформации.Добавить("НомераПломб");
	
	Возврат ПоляТранспортнойИнформации;
КонецФункции

Процедура ОбновитьПлановыеДатыДоставкиЗаявокКлиента()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаНабора", ЭтотОбъект.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНабора.Объект КАК ЗаказКлиента,
	|	НАЧАЛОПЕРИОДА(ТаблицаНабора.ПлановаяДатаДоставкиС, ДЕНЬ) КАК ПлановаяДатаДоставки
	|ПОМЕСТИТЬ НовыеПлановыеДатыДоставки
	|ИЗ
	|	&ТаблицаНабора КАК ТаблицаНабора
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ТаблицаНабора.Объект) = ТИП(Документ.ЗаказКлиента)
	|	И НАЧАЛОПЕРИОДА(ТаблицаНабора.ПлановаяДатаДоставкиС, ДЕНЬ) <> ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыеПлановыеДатыДоставки.ЗаказКлиента КАК ЗаказКлиента,
	|	МИНИМУМ(НовыеПлановыеДатыДоставки.ПлановаяДатаДоставки) КАК ПлановаяДатаДоставки
	|ПОМЕСТИТЬ ПлановыеДатыДоставкиЗаказов
	|ИЗ
	|	НовыеПлановыеДатыДоставки КАК НовыеПлановыеДатыДоставки
	|
	|СГРУППИРОВАТЬ ПО
	|	НовыеПлановыеДатыДоставки.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказовКлиента.бг_ЗаявкаКлиента КАК ЗаявкаКлиента,
	|	ТаблицаЗаказовКлиента.бг_ЗаявкаКлиента.ПлановаяДатаДоставки КАК ПлановаяДатаДоставки,
	|	МИНИМУМ(ЕСТЬNULL(ПлановыеДатыДоставкиЗаказов.ПлановаяДатаДоставки, ТаблицаЗаказовКлиента.бг_ЗаявкаКлиента.ПлановаяДатаДоставки)) КАК НоваяПлановаяДатаДоставки
	|ПОМЕСТИТЬ ДатыДоставкиЗаявок
	|ИЗ
	|	Документ.ЗаказКлиента КАК ТаблицаЗаказовКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПлановыеДатыДоставкиЗаказов КАК ПлановыеДатыДоставкиЗаказов
	|		ПО ТаблицаЗаказовКлиента.Ссылка = ПлановыеДатыДоставкиЗаказов.ЗаказКлиента
	|ГДЕ
	|	ТаблицаЗаказовКлиента.Ссылка В
	|			(ВЫБРАТЬ
	|				НовыеПлановыеДатыДоставки.ЗаказКлиента
	|			ИЗ
	|				НовыеПлановыеДатыДоставки КАК НовыеПлановыеДатыДоставки)
	|	И ТаблицаЗаказовКлиента.бг_ЗаявкаКлиента <> ЗНАЧЕНИЕ(Документ.битЗаявкаКлиента.ПустаяСсылка)
	|	И ТаблицаЗаказовКлиента.бг_ЗаявкаКлиента.ИсточникЗаказа В (
	|		ЗНАЧЕНИЕ(Перечисление.бг_ИсточникиЗагрузкиЗаказовКлиентов.WINELAB_SAP),
	|		ЗНАЧЕНИЕ(Перечисление.бг_ИсточникиЗагрузкиЗаказовКлиентов.WINELAB_SAP_СONSOLIDATED))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗаказовКлиента.бг_ЗаявкаКлиента,
	|	ТаблицаЗаказовКлиента.бг_ЗаявкаКлиента.ПлановаяДатаДоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыДоставкиЗаявок.ЗаявкаКлиента КАК ЗаявкаКлиента,
	|	ДатыДоставкиЗаявок.ПлановаяДатаДоставки КАК ПлановаяДатаДоставки,
	|	ДатыДоставкиЗаявок.НоваяПлановаяДатаДоставки КАК НоваяПлановаяДатаДоставки
	|ИЗ
	|	ДатыДоставкиЗаявок КАК ДатыДоставкиЗаявок
	|ГДЕ
	|	ДатыДоставкиЗаявок.ПлановаяДатаДоставки <> ДатыДоставкиЗаявок.НоваяПлановаяДатаДоставки
	|	И ДатыДоставкиЗаявок.НоваяПлановаяДатаДоставки <> ДАТАВРЕМЯ(1, 1, 1)";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Попытка

			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.битЗаявкаКлиента");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.ЗаявкаКлиента);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			ЗаявкаКлиентаОбъект = Выборка.ЗаявкаКлиента.ПолучитьОбъект();
			ЗаявкаКлиентаОбъект.ДополнительныеСвойства.Вставить("бг_ОтключитьСинхронизациюЗависимыхДокументов");
			ЗаявкаКлиентаОбъект.ПлановаяДатаДоставки = Выборка.НоваяПлановаяДатаДоставки;
			ЗаявкаКлиентаОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			ШаблонСообщения = 
				НСтр("ru = 'Обновлена плановая дата поставки в заявке %1'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ЗаявкаКлиента);
			
			ЗаписьЖурналаРегистрации(
				РегистрыСведений.бг_ОчередьЗаявокКлиентовКОтправкеOrderSP.СобытиеЖурналаРегистрацииОтправкаOrderSP(),
				УровеньЖурналаРегистрации.Информация,
				,
				Выборка.ЗаявкаКлиента,
				ТекстСообщения);
			
		Исключение
			
			ШаблонСообщения = 
				НСтр("ru = 'Не удалось обновить плановую дату поставки в заявке %1
                           | По причине: %2'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ЗаявкаКлиента, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ДополнитьТекстСообщениямиПользователю(ТекстСообщения);
			
			ЗаписьЖурналаРегистрации(
				РегистрыСведений.бг_ОчередьЗаявокКлиентовКОтправкеOrderSP.СобытиеЖурналаРегистрацииОтправкаOrderSP(),
				УровеньЖурналаРегистрации.Ошибка,
				,
				Выборка.ЗаявкаКлиента,
				ТекстСообщения);
				
			ВызватьИсключение ТекстСообщения;
			
		КонецПопытки
		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьТекстСообщениямиПользователю(ТекстСообщения) 
	
	Сообщения = ПолучитьСообщенияПользователю(Истина);
	
	Для Каждого Сообщение Из Сообщения Цикл
		ТекстСообщения = ТекстСообщения + Символы.ПС + Сообщение.Текст;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
